## Plan Result (Aks_preview)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * azurerm_role_assignment.disk
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]
* Update
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-preview-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # azurerm_resource_group.kubernetes_resource_group["00"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-preview-00-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "916381c3-3565-4fa9-80bc-1e7754942106"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/ae228581-8c7c-47c1-918e-2cd4c380470d/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi/federatedIdentityCredentials/cft-preview-00-aks"
        name                      = "cft-preview-00-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = false
      + dns_prefix                          = "k8s-cft-preview-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.27"
      + location                            = "uksouth"
      + name                                = "cft-preview-00-aks"
      + node_resource_group                 = "cft-preview-00-aks-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cft-preview-00-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 6
          + max_pods                     = 30
          + min_count                    = 4
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.27"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-cft-deploy"
              + "businessArea" = "CFT"
              + "criticality"  = "Low"
              + "environment"  = "development"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-network-rg/providers/Microsoft.Network/virtualNetworks/cft-preview-vnet/subnets/aks-00"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
              + "2",
              + "3",
            ]
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+s99FmkHwqdBbbzgw0Q9vqqJb0VkJ+QrmN5elArYOSX5HER+jAooyOEiZNynoL+oYBZT52p6sSVOvvccl06GX1FNfRkC6A8DlAUeIPO56N4/8awfxT1F1ydjMWHgZcZrPZiFUxH/duvlGqtqnO0iQzWKLsXovGFn0xPRAexK0004Ij1igfMZ+PyxQBunawZFo67cSJu3LpHd/fxqGd/qHBQ1iR01NdRjEBIUKh3/0LxIhOB3I0jxadXGQYXwCV1xefhVrHS13dqJH9tNkHB8YbCQ24hiVd2bmxjBPhS767pfByLkzRIFkYX9l5aSIDl3QLOAQruv5F36kMN9OmyXz aks-ssh"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 0
      + mode                  = "User"
      + name                  = "cronjob"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "dedicated=jobs:NoSchedule",
        ]
      + orchestrator_version  = "1.27"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-network-rg/providers/Microsoft.Network/virtualNetworks/cft-preview-vnet/subnets/aks-00"
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 180
      + max_pods              = 60
      + min_count             = 30
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.27"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D8ds_v5"
      + vnet_subnet_id        = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-network-rg/providers/Microsoft.Network/virtualNetworks/cft-preview-vnet/subnets/aks-00"
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 5
      + max_pods              = 30
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spotinstance"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = "1.27"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-network-rg/providers/Microsoft.Network/virtualNetworks/cft-preview-vnet/subnets/aks-00"
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + timeouts {
          + update = "180m"
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      ~ id                                     = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi/providers/Microsoft.Authorization/roleAssignments/f6aef1be-7c4c-6df3-ace8-935416c2c069" -> (known after apply)
      ~ name                                   = "f6aef1be-7c4c-6df3-ace8-935416c2c069" -> (known after apply)
      ~ principal_id                           = "eee79ad4-9586-40cd-af88-4e1c76090e37" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "global_registry_acrpull" {
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/3ce803db-cac2-9cf2-60da-23b09f0e259c" -> (known after apply)
      ~ name                                   = "3ce803db-cac2-9cf2-60da-23b09f0e259c" -> (known after apply)
      ~ principal_id                           = "eee79ad4-9586-40cd-af88-4e1c76090e37" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-00-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69c0f21d-e37c-41c2-8e16-b6873e941cea"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ kubelet_object_ids = "eee79ad4-9586-40cd-af88-4e1c76090e37,05dca73c-e67c-4343-a775-3ae6c5cd3853" -> (known after apply)
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/disks-preview-rg" -> null
        name       = "disks-preview-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
            "startupMode"  = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster has been deleted
  - resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - id                                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-preview-00-aks" -> null
        name                                = "cft-preview-00-aks"
      - oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/ae228581-8c7c-47c1-918e-2cd4c380470d/" -> null
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (34 unchanged attributes hidden)

      - kubelet_identity {
          - object_id                 = "eee79ad4-9586-40cd-af88-4e1c76090e37" -> null
            # (2 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":620,"Program":"tfcmt","SHA1":"","Target":"Aks_preview","Vars":{}} -->